cases/artigo_mestrado/old/pipe-membrane/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3860;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3900;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       4000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       4100;
    }
    membraneFront
    {
        type            cyclic;
        inGroups        2(cyclic membrane);
        nFaces          20;
        startFace       8100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  membraneBack;
    }
    membraneBack
    {
        type            cyclic;
        inGroups        2(cyclic membrane);
        nFaces          20;
        startFace       8120;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  membraneFront;
    }
)

// ************************************************************************* //
