cases/artigo_mestrado/old/pipe-membrane/fluid/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Aqueous humour approximated as water: nu = 1e-3 m2/s
// Re = U*H/nu = 0.5 * 0.4 / 1e-3 = 200 (laminar)

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-3;
